window.noname_update = {
	version: "1.4.2",
	update: "1.4.2",
	changeLog: [
			"完善封印伤害机制",
			"新增最近对局功能",
			"修复被放逐者使用鬼牌应战攻击时可以选择应战伤害来源的敌方单位",
			"修复ai幽魂法师发动腐蚀时会攻击队友的问题",
			"提高暗之王女扼杀光明的技能优先级，使其符合FAQ结算先后顺序",
			"修复战歌祭司战意共鸣也能响应应战攻击的bug",
			"修复龙语者发动龙魂凝视攻击未命中后，仍然保留大招作用效果的问题，并优化上古秘语子技	 能结算时机",
			"修复真龙女王发动百万龙炎后有同系牌不弃选择取消会引发游戏崩溃的问题（条件错误）",
			"优化接口请求参数的请求方式，模式筛选新增4v4",
			"修复排行榜的按钮在进行模式筛选或ai筛选后，按钮会点击失效的问题",
			"修复圣仲裁者舍弃牌错误日志",
			"优化能量标记信息",
			"修复红衣主教驱魔式ai,技能发动后会导致自己无法行动",
			"修复贪婪少女亡女的金库转移士气会触发其他角色士气下降技能",
			"修复贪婪少女亡女的金库移除宝石为1也会转移士气",

	],
	files: [

	],
};
