window.noname_update = {
	version: "1.3.7",
	update: "1.3.7",
	changeLog: [
		"修改get.characterGetsi函数，未指定数量时不再直接返回列表，将继续进行角色无法同时出现处理",
		"修复剑之子风之剑不选择发动疾风技时报错和技能错别字描述",
		"角色技能适配调整手牌函数",
		"新增玩家手牌调整函数",
		"史书新增进入弃牌堆时被移除效果",
		"删除无用代码",
		"修改未日预言添加预言逻辑",
		"优化王权宝珠牌的放置逻辑",
		"修复魔剑士黄泉震颤错误id",
		"修复女武神军神威光错误id",
		"修复三版女武神军神威光在战绩区不满2星石的情况可以选择工选项",
		"修复tick圣弓自动填充与实际不符，二选项加治疗无法选其他人",
		"修改css文件中文件名大小写，严格匹配实际文件名",
		"修复瘟疫法师死亡之触错误描述",
		"增加三版瘟疫法师",
		"修复四版魔剑士黄泉震颤攻击命中时，手牌数大于4张时会弃4张牌",
		"修复天使风之洁净ai无法移除角色带来的基础效果",
	],
	files: [

	],
};
