window.noname_update = {
	version: "1.4.1",
	update: "1.4.1",
	changeLog: [
			"功能",
			"新增玩家函数chooseButtonCard，暂无角色使用",
			"玩家函数countTongXiPai和countYiXiPai支持type参数",
			
			"ai",

			"优化",
			"完善破晓技能描述",
			"修复神仲裁者替罪羔羊错别描述",
			"修复舍弃牌会触发discard触发器",
			"完善星级翻译",
			"重新修改破晓角色技能文本描述，使其更规范化",
			"修改部分破晓角色立绘图像",
			'兼容触屏的排行榜模式和AI筛选，并调整筛选相关字体',
			"调整设置录像界面导入按钮位置，调整至最上面",
			"调整排行榜和新手向导位置",
			"增加联机出牌实现180s和360s",
			"更改排行榜对局数限制，最低为10才纳入统计",

			"bug",
			"修复剑舞者联机模式下技能无法选中目标的问题，以及发动剑舞仪式后手牌上限显示异常的问题",
			"修复大地武士盖亚形态内发动生生不息后，可以发动破邪斩的问题",
			"提高皇家侍卫牺牲技能的优先级，避免与吟游诗人的乐章buff结算冲突",
			"修正了幽魂法师幽魂分身可以响应两次腐蚀的效果，现在发动腐蚀后不会再触发幽魂分身",
			"修正了大司祭圣光闪耀不展示手牌的问题",
			"修改剑舞者的剑舞仪式技能和守望者的护教之心的具体实现，使其更符合技能描述",
			"幽魂法师的腐蚀技能修正回符合破晓文本规范化描述的效果",
			"修正咒术师的咒缚技能效果，使其结算符合描述",
			"修复圣仲裁者天平倾倒会触发圣方之右",
			"修复圣仲裁者天罪ai，攻击命中无返回值导致报错",
			"修复捣蛋萝莉trick牌明置",
			"修复圣仲裁者善恶必计伤害被阻挡后仍可发动",
			"修复星坠女巫卢恩可超上限",
			'调整字体大小，修复触摸模式下点击角色时因绑定了错误对象引发的报错问题',
			"修复玩家函数chooseButtonTarget联机失效",
			"修复见习制片等被挑衅仍可发动独有法术",
			"修复魔弓EX闪光陷阱错误前缀",
			"修复选角列表会出现重复角色",
			"修改挑衅效果，移除回合开始跳过回合效果",

	],
	files: [

	],
};
